# Install Cask
brew 'caskroom/cask/brew-cask'

# install taps
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'macvim'
brew 'wget'
brew 'nvm'
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'ruby-build'
brew 'boot2docker'
brew 'docker'
brew 'jenv'
brew 'pyenv'

cask 'java'
cask 'virtualbox'
cask 'vagrant'
cask 'google-chrome'
cask 'eclipse-java'
cask 'firefox'
cask 'opera'
cask 'hipchat'
cask 'spotify'
cask 'skype'
cask 'colloquy'
cask 'google-drive'
cask 'dropbox'