tap "aws/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "redpanda-data/tap"
brew "coreutils"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "aws-sam-cli"
brew "docutils"
brew "awscli"
brew "eksctl"
brew "figlet"
brew "fluxctl"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "go"
brew "goenv"
brew "jq"
brew "k9s"
brew "neovim"
brew "node"
brew "nvm"
brew "pass"
brew "pgcli"
brew "postgresql@14"
brew "pwgen"
brew "pyenv"
brew "rustup"
brew "socat"
brew "sshuttle"
brew "telnet"
brew "tfenv"
brew "wget"
brew "yq"
brew "aws/tap/eks-node-viewer"
brew "fluxcd/tap/flux"
brew "redpanda-data/tap/redpanda"
cask "asana"
cask "drawio"
cask "finch"
cask "hammerspoon"
cask "iterm2"
cask "lens"
cask "microsoft-teams"
cask "obs"
cask "offset-explorer"
cask "sqlectron"
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "rust-lang.rust-analyzer"
vscode "yzhang.markdown-all-in-one"
